---
kind: property
id: P:Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.TotalSize
source: html/c92d243d-ee90-f05c-e745-cb63d7a0b2b2.htm
---
# Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs.TotalSize Property

Total expected data size to transfer, in bytes.

## Syntax (C#)
```csharp
public double TotalSize { get; }
```